InformationRegisters/ИзмененияВзаимодействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ИзмененияВзаимодействий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтароеЗначение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:DocumentRef.Запрос</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НовоеЗначение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:DocumentRef.Запрос</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Реквизит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Взаимодействие</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ТелефонныйЗвонок</v8:Type>
						<v8:Type>cfg:DocumentRef.Встреча</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИзмененияВзаимодействий/Ext/ManagerModule.bsl
Процедура ЗаписьИзменений(Взаимодействие, НаборНовых, НаборСтарых, Предмет, Рассмотрено, РассмотретьПосле)
	
	ДатаИзменения = ТекущаяДата();
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	//Совпадающие поля объекта
	ПроверитьПоле(Взаимодействие, ДатаИзменения, ТекущийПользователь, "ДатаОкончания", 	  НаборНовых, НаборСтарых);
	ПроверитьПоле(Взаимодействие, ДатаИзменения, ТекущийПользователь, "Отменено", 		  НаборНовых, НаборСтарых);
	ПроверитьПоле(Взаимодействие, ДатаИзменения, ТекущийПользователь, "МестоПроведенияВстречи", НаборНовых, НаборСтарых);
	ПроверитьПоле(Взаимодействие, ДатаИзменения, ТекущийПользователь, "Ответственный", 	  НаборНовых, НаборСтарых);
	
	//Разные поля/ТЧ объекта
	Если ТипЗнч(Взаимодействие) = Тип("ДокументСсылка.Встреча") Тогда
		ПроверитьПолеТЧ(Взаимодействие, ДатаИзменения, ТекущийПользователь, "Контакт", ПолучитьСписокКонтактов(НаборНовых), ПолучитьСписокКонтактов(НаборСтарых));
	ИначеЕсли ТипЗнч(Взаимодействие) = Тип("ДокументСсылка.ТелефонныйЗвонок") Тогда
		Если НаборНовых.АбонентКонтакт <> НаборСтарых.АбонентКонтакт Тогда
			
			НовыйКонтакт = СокрЛП(НаборНовых.АбонентПредставление) + " - " + СокрЛП(НаборНовых.АбонентКакСвязаться);
			СтарыйКонтакт = СокрЛП(НаборСтарых.АбонентПредставление) + " - " + СокрЛП(НаборСтарых.АбонентКакСвязаться);
			
			ЗаписатьИзменениеВРегистр(Взаимодействие, ДатаИзменения, ТекущийПользователь, "Контакт", НовыйКонтакт, СтарыйКонтакт);
		КонецЕсли;
	КонецЕсли;
	
	НаборДоп = Взаимодействия.СтруктураРеквизитовВзаимодействия(НаборСтарых);
	
	//Поля формы
	Если НаборДоп.Предмет <> Предмет Тогда
		ЗаписатьИзменениеВРегистр(Взаимодействие, ДатаИзменения, ТекущийПользователь, "Предмет", Предмет, НаборДоп.Предмет);
	КонецЕсли;
	
	Если НаборДоп.Рассмотрено <> Рассмотрено Тогда
		ЗаписатьИзменениеВРегистр(Взаимодействие, ДатаИзменения, ТекущийПользователь, "Рассмотрено", Рассмотрено, НаборДоп.Рассмотрено);
	КонецЕсли;
	
	Если НаборДоп.РассмотретьПосле <> РассмотретьПосле Тогда
		ЗаписатьИзменениеВРегистр(Взаимодействие, ДатаИзменения, ТекущийПользователь, "РассмотретьПосле", РассмотретьПосле, НаборДоп.РассмотретьПосле);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСписокКонтактов(Набор)
	
	НС = "";
	
	Если Набор.Метаданные().ТабличныеЧасти.Найти("Участники") <> Неопределено Тогда
		Для Каждого Контакт Из Набор.Участники Цикл
			НС = НС + ?(ЗначениеЗаполнено(Контакт.Контакт), Контакт.Контакт.ФИО, СокрЛП(Контакт.ПредставлениеКонтакта)) + " - " + СокрЛП(Контакт.КакСвязаться) + "; ";
		КонецЦикла;
		НС = Сред(НС, 1, СтрДлина(НС) - 2);
	КонецЕсли;
	
	Возврат НС;
	
КонецФункции

Процедура ПроверитьПолеТЧ(Взаимодействие, ДатаИзменения, ТекущийПользователь, Реквизит, НовоеЗначение, СтароеЗначение)
	
	Если Реквизит = "Контакт" Тогда
		Если НовоеЗначение <> СтароеЗначение Тогда
			ЗаписатьИзменениеВРегистр(Взаимодействие, ДатаИзменения, ТекущийПользователь, Реквизит, НовоеЗначение, СтароеЗначение);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьИзменениеВРегистр(Взаимодействие, ДатаИзменения, ТекущийПользователь, Реквизит, НовоеЗначение, СтароеЗначение) Экспорт
	
	Набор = РегистрыСведений.ИзмененияВзаимодействий.СоздатьНаборЗаписей();
	Набор.Отбор.Взаимодействие.Установить(Взаимодействие);
	Набор.Прочитать();
	
	Запись = Набор.Добавить();
	Запись.Период = ДатаИзменения;
	Запись.Взаимодействие = Взаимодействие;
	Запись.Ответственный = ТекущийПользователь;
	
	Запись.Реквизит = Реквизит;
	Запись.НовоеЗначение = НовоеЗначение;
	Запись.СтароеЗначение = СтароеЗначение;
	
	Набор.Записать();
	
КонецПроцедуры

Процедура ПроверитьПоле(Взаимодействие, ДатаИзменения, ТекущийПользователь, Реквизит, НаборНовых, НаборСтарых)
	
	Если НаборНовых.Метаданные().Реквизиты.Найти(Реквизит) <> Неопределено Тогда
		Если НаборНовых[Реквизит] <> НаборСтарых[Реквизит] Тогда
			ЗаписатьИзменениеВРегистр(Взаимодействие, ДатаИзменения, ТекущийПользователь, Реквизит, НаборНовых[Реквизит], НаборСтарых[Реквизит]);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьОбъект(Объект, Предмет, Рассмотрено, РассмотретьПосле) Экспорт
	
	ЗаписьИзменений(Объект.Ссылка, Объект, Объект.Ссылка, Предмет, Рассмотрено, РассмотретьПосле);
	
КонецПроцедуры
